## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 7 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| update | `aws_lambda_function.audit_logs`      |
|        | `aws_lambda_function.reliability`     |
|        | `aws_lambda_function.submission`      |
|        | `aws_lambda_function.vault_integrity` |
|        | `aws_s3_object.audit_logs_code`       |
|        | `aws_s3_object.reliability_code`      |
|        | `aws_s3_object.submission_code`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-02-21T20:01:23.000+0000" -> (known after apply)
      ~ s3_object_version              = "mlT7Y80H6tQjC5C7XxyPcEwB9o0gH8_1" -> (known after apply)
      ~ source_code_hash               = "uJgR/UkrTb9d9cw3c7/M14DNOgixZp33RJLBUZP3LQ0=" -> "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2024-01-12T15:13:35.000+0000" -> (known after apply)
      ~ s3_object_version              = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
      ~ source_code_hash               = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "7GytmQkLshgAsM56ZBQ2wQlnmEMfU7gagap8ylA+StE="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-02-21T20:01:24.000+0000" -> (known after apply)
      ~ s3_object_version              = "Vqk6Kq.ro7D.UgmbX.0vaiVH88_mjybu" -> (known after apply)
      ~ source_code_hash               = "MUixujtBoNJnnkSJ7B6Vthx0gUQCXxS8qA23h6mRcC8=" -> "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-03-11T22:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "uJgR/UkrTb9d9cw3c7/M14DNOgixZp33RJLBUZP3LQ0=" -> "8XJrXQPGK78QNXqkYizyGlH5uM+xYA/x57QzSc/sbKw="
        tags                   = {}
      ~ version_id             = "mlT7Y80H6tQjC5C7XxyPcEwB9o0gH8_1" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.reliability_code will be updated in-place
  ~ resource "aws_s3_object" "reliability_code" {
        id                     = "reliability_code"
      ~ source_hash            = "Y9H8sLPZL9F6011TefCnrblzwHpvwKdIvkqDSPaxVK8=" -> "7GytmQkLshgAsM56ZBQ2wQlnmEMfU7gagap8ylA+StE="
        tags                   = {}
      ~ version_id             = "2lirn5yEVP_uG9YM3ISy6i45Nc_DI.cg" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "MUixujtBoNJnnkSJ7B6Vthx0gUQCXxS8qA23h6mRcC8=" -> "DJVk2STondW1jm6Vj61kIHKK8sQw/oCC/75SlBdG3b8="
        tags                   = {}
      ~ version_id             = "Vqk6Kq.ro7D.UgmbX.0vaiVH88_mjybu" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
